2gua.rainbow-brackets
42Crunch.vscode-openapi
ardenivanov.svelte-intellisense
betterthantomorrow.calva
blzjns.vscode-raml
bmewburn.vscode-intelephense-client
borkdude.clj-kondo
bradlc.vscode-tailwindcss
bungcip.better-toml
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dariofuzinato.vue-peek
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
eg2.tslint
eg2.vscode-npm-script
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
hashicorp.terraform
hex-ci.stylelint-plus
jacobdufault.fuzzy-search
JamesBirtles.svelte-vscode
jasonnutter.search-node-modules
jpoissonnier.vscode-styled-components
junstyle.php-cs-fixer
kahole.magit
kumar-harsh.graphql-for-vscode
LaurentTreguier.vscode-simple-icons
mermade.openapi-lint
mikestead.dotenv
mrmlnc.vscode-attrs-sorter
mrmlnc.vscode-scss
ms-azuretools.vscode-docker
ms-python.python
ms-vscode.node-debug2
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.vscode-react-native
mubaidr.vuejs-extension-pack
octref.vetur
redhat.vscode-yaml
ricard.postcss
robertoachar.vscode-essentials-snippets
sasa.vscode-sass-format
scala-lang.scala
scalameta.metals
shanoor.vscode-nginx
sharat.vscode-brewfile
shinnn.stylelint
sidthesloth.html5-boilerplate
stylelint.vscode-stylelint
timonwong.shellcheck
tombonnike.vscode-status-bar-format-toggle
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
vscodevim.vim
VSpaceCode.vspacecode
VSpaceCode.whichkey
whatwedo.twig
